* >Natural Source Code: INVREL
* SUBPROGRAM: INVREL - INVENTORY RELEASE
* DESCRIPTION: RELEASES PREVIOUSLY RESERVED INVENTORY
*              CALLED ON ORDER CANCEL OR RESERVATION EXPIRY
* LIBRARY: RETAILCORE
* ADABAS FILES: 105 (INVENTORY), 106 (RESERVATION)
* CREATED: 1998-09-15  K. PATEL
* MODIFIED: 2005-07-20 - ADDED PARTIAL RELEASE
* MODIFIED: 2014-11-10 - ADDED EXPIRY BATCH SUPPORT
* MODIFIED: 2020-08-22 - ADDED BACKORDER CHECK
* -------------------------------------------------------
DEFINE DATA
PARAMETER
  1 P-RESERVATION-ID      (N10)   /* SPECIFIC RESERVATION */
  1 P-ORDER-ID            (N10)   /* OR RELEASE ALL FOR ORDER */
  1 P-RELEASE-QTY         (N8)    /* 0=RELEASE ALL */
  1 P-RELEASED-QTY        (N8)    /* RETURNED - ACTUAL RELEASED */
  1 P-RC                  (N4)
  1 P-RC-TEXT             (A80)
*
LOCAL
  1 #USER-ID              (A8)
  1 #QTY-TO-RELEASE       (N8)
  1 #TOTAL-RELEASED       (N8)
  1 #INV-STR              (A15)
*
  1 RES-REL-VIEW VIEW OF RESERVATION-FILE
    2 RR-ID                (N10)
    2 RR-PROD-ID           (N8)
    2 RR-LOC-TYPE          (A1)
    2 RR-LOC-ID            (N4)
    2 RR-ORDER-ID          (N10)
    2 RR-QTY               (N8)
    2 RR-STATUS            (A1)
*
  1 INV-REL-VIEW VIEW OF INVENTORY-FILE
    2 IL-PROD-ID           (N8)
    2 IL-LOC-TYPE          (A1)
    2 IL-LOC-ID            (N4)
    2 IL-RESERVED          (N8)
    2 IL-AVAILABLE         (N8)
    2 IL-ON-HAND           (N8)
END-DEFINE
*
MOVE *USER TO #USER-ID
RESET P-RC
RESET #TOTAL-RELEASED
*
* RELEASE BY RESERVATION ID
IF P-RESERVATION-ID > 0
  FIND RES-REL-VIEW WITH RR-ID = P-RESERVATION-ID
    IF NO RECORDS FOUND
      MOVE 303 TO P-RC
      MOVE 'RESERVATION NOT FOUND' TO P-RC-TEXT
      ESCAPE ROUTINE
    END-NOREC
*
    IF RR-STATUS NE 'R'
      MOVE 303 TO P-RC
      MOVE 'RESERVATION NOT IN RESERVED STATUS' TO P-RC-TEXT
      ESCAPE ROUTINE
    END-IF
*
    IF P-RELEASE-QTY > 0 AND P-RELEASE-QTY < RR-QTY
      MOVE P-RELEASE-QTY TO #QTY-TO-RELEASE
    ELSE
      MOVE RR-QTY TO #QTY-TO-RELEASE
    END-IF
*
    PERFORM RELEASE-INVENTORY
    ESCAPE BOTTOM
  END-FIND
*
* RELEASE ALL RESERVATIONS FOR ORDER
ELSE IF P-ORDER-ID > 0
  FIND RES-REL-VIEW WITH RR-ORDER-ID = P-ORDER-ID
      AND RR-STATUS = 'R'
    MOVE RR-QTY TO #QTY-TO-RELEASE
    PERFORM RELEASE-INVENTORY
  END-FIND
ELSE
  MOVE 303 TO P-RC
  MOVE 'RESERVATION ID OR ORDER ID REQUIRED' TO P-RC-TEXT
  ESCAPE ROUTINE
END-IF
END-IF
*
MOVE #TOTAL-RELEASED TO P-RELEASED-QTY
*
* -------------------------------------------------------
* RELEASE INVENTORY FOR A RESERVATION
* -------------------------------------------------------
DEFINE SUBROUTINE RELEASE-INVENTORY
*
  * UPDATE RESERVATION STATUS
  GET RES-REL-VIEW *ISN (HOLD)
*
  ON ERROR
    IF *ERROR-NR = 145
      MOVE 305 TO P-RC
      MOVE 'RESERVATION LOCKED' TO P-RC-TEXT
      ESCAPE ROUTINE
    END-IF
  END-ERROR
*
  IF #QTY-TO-RELEASE >= RR-QTY
    MOVE 'L' TO RR-STATUS   /* L = RELEASED */
  ELSE
    SUBTRACT #QTY-TO-RELEASE FROM RR-QTY
  END-IF
  UPDATE RES-REL-VIEW
*
  * UPDATE INVENTORY RESERVED COUNT
  FIND INV-REL-VIEW WITH IL-PROD-ID = RR-PROD-ID
      AND IL-LOC-TYPE = RR-LOC-TYPE
      AND IL-LOC-ID = RR-LOC-ID
    GET INV-REL-VIEW *ISN (HOLD)
    SUBTRACT #QTY-TO-RELEASE FROM IL-RESERVED
    IF IL-RESERVED < 0
      MOVE 0 TO IL-RESERVED
    END-IF
    COMPUTE IL-AVAILABLE = IL-ON-HAND - IL-RESERVED
    UPDATE INV-REL-VIEW
    ESCAPE BOTTOM
  END-FIND
*
  END OF TRANSACTION
  ADD #QTY-TO-RELEASE TO #TOTAL-RELEASED
*
  * AUDIT
  MOVE P-RESERVATION-ID TO #INV-STR
  CALLNAT 'AUDITN' 'INV' #INV-STR 'U' 'RELEASE'
    ' ' ' ' 'INVENTORY RELEASED'
*
END-SUBROUTINE
*
END
