* >Natural Source Code: INVREC
* SUBPROGRAM: INVREC - INVENTORY RECONCILIATION
* DESCRIPTION: PERFORMS INVENTORY RECONCILIATION BETWEEN
*              PHYSICAL COUNTS AND SYSTEM RECORDS
* LIBRARY: RETAILCORE
* ADABAS FILES: 105 (INVENTORY), 109 (RECONCILIATION)
* CREATED: 2001-03-15  K. PATEL
* MODIFIED: 2009-06-22 - ADDED VARIANCE REPORTING
* MODIFIED: 2017-11-15 - ADDED AUTO-ADJUSTMENT
* -------------------------------------------------------
DEFINE DATA
PARAMETER
  1 P-OPERATION           (A4)    /* INIT ITEM CLOS */
  1 P-LOC-TYPE            (A1)
  1 P-LOC-ID              (N4)
  1 P-RECON-ID            (N10)   /* EXISTING OR RETURNED */
  1 P-PROD-ID             (N8)    /* FOR ITEM OPERATION */
  1 P-PHYSICAL-COUNT      (N8)    /* ACTUAL COUNT */
  1 P-VARIANCE            (N8)    /* RETURNED VARIANCE */
  1 P-TOTAL-VARIANCE-AMT  (N10.2) /* TOTAL DOLLAR VARIANCE */
  1 P-RC                  (N4)
  1 P-RC-TEXT             (A80)
*
LOCAL
  1 #USER-ID              (A8)
  1 #RECON-SEQ            (N10)
  1 #SYSTEM-QTY           (N8)
  1 #VARIANCE             (N8)
  1 #RECON-STR            (A15)
  1 #INV-RC               (N4)
  1 #INV-MSG              (A80)
  1 #UNIT-COST            (N9.2)
  1 #VARIANCE-AMT         (N10.2)
*
  1 RECON-VIEW VIEW OF RECON-FILE
    2 RC-ID                (N10)
    2 RC-LOC-TYPE          (A1)
    2 RC-LOC-ID            (N4)
    2 RC-DATE              (D)
    2 RC-STATUS            (A1)
    2 RC-ITEMS-COUNTED     (N6)
    2 RC-ITEMS-MATCHED     (N6)
    2 RC-ITEMS-VARIANCE    (N6)
    2 RC-TOTAL-VARIANCE    (N10.2)
    2 RC-CONDUCTED-BY      (A8)
*
  1 INV-RECON-VIEW VIEW OF INVENTORY-FILE
    2 IC-PROD-ID           (N8)
    2 IC-LOC-TYPE          (A1)
    2 IC-LOC-ID            (N4)
    2 IC-ON-HAND           (N8)
    2 IC-LAST-COUNT-DATE   (D)
*
  1 PROD-COST-VIEW VIEW OF PRODUCT-FILE
    2 PC-ID                (N8)
    2 PC-BASE-COST         (N9.2)
END-DEFINE
*
MOVE *USER TO #USER-ID
RESET P-RC
*
DECIDE ON FIRST VALUE OF P-OPERATION
  VALUE 'INIT'
    PERFORM INIT-RECONCILIATION
  VALUE 'ITEM'
    PERFORM COUNT-ITEM
  VALUE 'CLOS'
    PERFORM CLOSE-RECONCILIATION
  NONE VALUE
    MOVE 306 TO P-RC
    MOVE 'INVALID RECONCILIATION OPERATION' TO P-RC-TEXT
END-DECIDE
*
* -------------------------------------------------------
* INITIALIZE NEW RECONCILIATION
* -------------------------------------------------------
DEFINE SUBROUTINE INIT-RECONCILIATION
  CALLNAT 'SEQNON' 'RCNL' #RECON-SEQ
*
  STORE RECON-VIEW
    RC-ID             := #RECON-SEQ
    RC-LOC-TYPE       := P-LOC-TYPE
    RC-LOC-ID         := P-LOC-ID
    RC-DATE           := *DATX
    RC-STATUS         := 'P'
    RC-ITEMS-COUNTED  := 0
    RC-ITEMS-MATCHED  := 0
    RC-ITEMS-VARIANCE := 0
    RC-TOTAL-VARIANCE := 0
    RC-CONDUCTED-BY   := #USER-ID
  END-STORE
*
  END OF TRANSACTION
  MOVE #RECON-SEQ TO P-RECON-ID
END-SUBROUTINE
*
* -------------------------------------------------------
* COUNT INDIVIDUAL ITEM
* -------------------------------------------------------
DEFINE SUBROUTINE COUNT-ITEM
  IF P-RECON-ID = 0
    MOVE 306 TO P-RC
    MOVE 'RECONCILIATION ID REQUIRED' TO P-RC-TEXT
    ESCAPE ROUTINE
  END-IF
*
  * GET SYSTEM QUANTITY
  FIND INV-RECON-VIEW WITH IC-PROD-ID = P-PROD-ID
      AND IC-LOC-TYPE = P-LOC-TYPE
      AND IC-LOC-ID = P-LOC-ID
    IF NO RECORDS FOUND
      MOVE 0 TO #SYSTEM-QTY
      ESCAPE BOTTOM
    END-NOREC
    MOVE IC-ON-HAND TO #SYSTEM-QTY
    ESCAPE BOTTOM
  END-FIND
*
  * CALCULATE VARIANCE
  COMPUTE #VARIANCE = P-PHYSICAL-COUNT - #SYSTEM-QTY
  MOVE #VARIANCE TO P-VARIANCE
*
  * GET PRODUCT COST FOR DOLLAR VARIANCE
  FIND PROD-COST-VIEW WITH PC-ID = P-PROD-ID
    MOVE PC-BASE-COST TO #UNIT-COST
    ESCAPE BOTTOM
  END-FIND
  COMPUTE #VARIANCE-AMT = #VARIANCE * #UNIT-COST
*
  * UPDATE RECONCILIATION TOTALS
  FIND RECON-VIEW WITH RC-ID = P-RECON-ID
    GET RECON-VIEW *ISN (HOLD)
    ADD 1 TO RC-ITEMS-COUNTED
    IF #VARIANCE = 0
      ADD 1 TO RC-ITEMS-MATCHED
    ELSE
      ADD 1 TO RC-ITEMS-VARIANCE
      ADD #VARIANCE-AMT TO RC-TOTAL-VARIANCE
    END-IF
    UPDATE RECON-VIEW
    ESCAPE BOTTOM
  END-FIND
*
  * IF VARIANCE EXISTS, CREATE ADJUSTMENT
  * MODIFIED 2017-11-15 - AUTO-ADJUSTMENT
  IF #VARIANCE NE 0
    CALLNAT 'INVADJ' P-PROD-ID ' ' P-LOC-TYPE P-LOC-ID
      #VARIANCE 'RCNT' 'RECONCILIATION ADJUSTMENT'
      ' ' #INV-RC #INV-MSG
  END-IF
*
  * UPDATE LAST COUNT DATE
  FIND INV-RECON-VIEW WITH IC-PROD-ID = P-PROD-ID
      AND IC-LOC-TYPE = P-LOC-TYPE
      AND IC-LOC-ID = P-LOC-ID
    GET INV-RECON-VIEW *ISN (HOLD)
    MOVE *DATX TO IC-LAST-COUNT-DATE
    UPDATE INV-RECON-VIEW
    ESCAPE BOTTOM
  END-FIND
*
  END OF TRANSACTION
END-SUBROUTINE
*
* -------------------------------------------------------
* CLOSE RECONCILIATION
* -------------------------------------------------------
DEFINE SUBROUTINE CLOSE-RECONCILIATION
  FIND RECON-VIEW WITH RC-ID = P-RECON-ID
    IF NO RECORDS FOUND
      MOVE 306 TO P-RC
      MOVE 'RECONCILIATION NOT FOUND' TO P-RC-TEXT
      ESCAPE ROUTINE
    END-NOREC
    GET RECON-VIEW *ISN (HOLD)
    MOVE 'C' TO RC-STATUS
    UPDATE RECON-VIEW
    MOVE RC-TOTAL-VARIANCE TO P-TOTAL-VARIANCE-AMT
    END OF TRANSACTION
    ESCAPE BOTTOM
  END-FIND
*
  MOVE P-RECON-ID TO #RECON-STR
  CALLNAT 'AUDITN' 'INV' #RECON-STR 'U' 'RECON'
    ' ' ' ' 'RECONCILIATION CLOSED'
END-SUBROUTINE
*
END
