* >Natural Source Code: INVTRN
* SUBPROGRAM: INVTRN - STOCK TRANSFER
* DESCRIPTION: PROCESSES STOCK TRANSFERS BETWEEN
*              STORES AND WAREHOUSES
* LIBRARY: RETAILCORE
* ADABAS FILES: 105 (INVENTORY), 108 (TRANSFER)
* CREATED: 2000-01-20  K. PATEL
* MODIFIED: 2007-05-15 - ADDED APPROVAL WORKFLOW
* MODIFIED: 2015-03-22 - ADDED SHIP/RECEIVE TRACKING
* MODIFIED: 2022-09-10 - ADDED TRANSFER REASON CODES
* -------------------------------------------------------
DEFINE DATA
PARAMETER
  1 P-OPERATION           (A4)    /* CREA APRV SHIP RECV CANC */
  1 P-TRANSFER-ID         (N10)   /* FOR EXISTING TRANSFERS */
  1 P-PROD-ID             (N8)
  1 P-SKU                 (A15)
  1 P-FROM-LOC-TYPE       (A1)
  1 P-FROM-LOC-ID         (N4)
  1 P-TO-LOC-TYPE         (A1)
  1 P-TO-LOC-ID           (N4)
  1 P-QTY                 (N8)
  1 P-REASON              (A4)    /* REPL RETN RBAL DMGD */
  1 P-NEW-TRANSFER-ID     (N10)   /* RETURNED ON CREATE */
  1 P-RC                  (N4)
  1 P-RC-TEXT             (A80)
*
LOCAL
  1 #USER-ID              (A8)
  1 #TRN-SEQ              (N10)
  1 #TRN-TYPE             (A2)
  1 #TRN-STR              (A15)
  1 #INV-RC               (N4)
  1 #INV-MSG              (A80)
*
  1 TRN-VIEW VIEW OF TRANSFER-FILE
    2 TV-ID                (N10)
    2 TV-TYPE              (A2)
    2 TV-FROM-LOC-TYPE     (A1)
    2 TV-FROM-LOC-ID       (N4)
    2 TV-TO-LOC-TYPE       (A1)
    2 TV-TO-LOC-ID         (N4)
    2 TV-PROD-ID           (N8)
    2 TV-SKU               (A15)
    2 TV-QTY               (N8)
    2 TV-STATUS            (A2)
    2 TV-REASON            (A4)
    2 TV-REQUEST-DATE      (D)
    2 TV-SHIP-DATE         (D)
    2 TV-RECV-DATE         (D)
    2 TV-CREATED-BY        (A8)
END-DEFINE
*
MOVE *USER TO #USER-ID
RESET P-RC
*
DECIDE ON FIRST VALUE OF P-OPERATION
  VALUE 'CREA'
    PERFORM CREATE-TRANSFER
  VALUE 'APRV'
    PERFORM APPROVE-TRANSFER
  VALUE 'SHIP'
    PERFORM SHIP-TRANSFER
  VALUE 'RECV'
    PERFORM RECEIVE-TRANSFER
  VALUE 'CANC'
    PERFORM CANCEL-TRANSFER
  NONE VALUE
    MOVE 308 TO P-RC
    MOVE 'INVALID TRANSFER OPERATION' TO P-RC-TEXT
END-DECIDE
*
* -------------------------------------------------------
* CREATE TRANSFER REQUEST
* -------------------------------------------------------
DEFINE SUBROUTINE CREATE-TRANSFER
*
  * VALIDATE LOCATIONS
  IF P-FROM-LOC-TYPE = P-TO-LOC-TYPE
      AND P-FROM-LOC-ID = P-TO-LOC-ID
    MOVE 308 TO P-RC
    MOVE 'SOURCE AND DESTINATION CANNOT BE SAME' TO P-RC-TEXT
    ESCAPE ROUTINE
  END-IF
*
  * DETERMINE TRANSFER TYPE
  COMPRESS P-FROM-LOC-TYPE P-TO-LOC-TYPE INTO #TRN-TYPE
    LEAVING NO SPACE
*
  * CHECK SOURCE INVENTORY
  CALLNAT 'INVCHK'
    P-PROD-ID P-SKU P-FROM-LOC-TYPE P-FROM-LOC-ID P-QTY
    ' ' ' ' ' ' ' ' ' ' ' ' ' ' ' ' ' '
    #INV-RC #INV-MSG
*
  * GENERATE TRANSFER ID
  CALLNAT 'SEQNON' 'TRN' #TRN-SEQ
*
  STORE TRN-VIEW
    TV-ID            := #TRN-SEQ
    TV-TYPE          := #TRN-TYPE
    TV-FROM-LOC-TYPE := P-FROM-LOC-TYPE
    TV-FROM-LOC-ID   := P-FROM-LOC-ID
    TV-TO-LOC-TYPE   := P-TO-LOC-TYPE
    TV-TO-LOC-ID     := P-TO-LOC-ID
    TV-PROD-ID       := P-PROD-ID
    TV-SKU           := P-SKU
    TV-QTY           := P-QTY
    TV-STATUS        := 'PE'
    TV-REASON        := P-REASON
    TV-REQUEST-DATE  := *DATX
    TV-CREATED-BY    := #USER-ID
  END-STORE
*
  END OF TRANSACTION
  MOVE #TRN-SEQ TO P-NEW-TRANSFER-ID
*
  MOVE #TRN-SEQ TO #TRN-STR
  CALLNAT 'AUDITN' 'TRN' #TRN-STR 'C' 'TRANSFER'
    ' ' ' ' 'TRANSFER CREATED'
*
END-SUBROUTINE
*
* -------------------------------------------------------
* APPROVE TRANSFER
* -------------------------------------------------------
DEFINE SUBROUTINE APPROVE-TRANSFER
  FIND TRN-VIEW WITH TV-ID = P-TRANSFER-ID
    IF NO RECORDS FOUND
      MOVE 308 TO P-RC
      MOVE 'TRANSFER NOT FOUND' TO P-RC-TEXT
      ESCAPE ROUTINE
    END-NOREC
    IF TV-STATUS NE 'PE'
      MOVE 308 TO P-RC
      MOVE 'TRANSFER NOT IN PENDING STATUS' TO P-RC-TEXT
      ESCAPE ROUTINE
    END-IF
    GET TRN-VIEW *ISN (HOLD)
    MOVE 'AP' TO TV-STATUS
    UPDATE TRN-VIEW
    END OF TRANSACTION
    ESCAPE BOTTOM
  END-FIND
END-SUBROUTINE
*
* -------------------------------------------------------
* SHIP TRANSFER - DEDUCT FROM SOURCE
* -------------------------------------------------------
DEFINE SUBROUTINE SHIP-TRANSFER
  FIND TRN-VIEW WITH TV-ID = P-TRANSFER-ID
    IF NO RECORDS FOUND
      MOVE 308 TO P-RC
      MOVE 'TRANSFER NOT FOUND' TO P-RC-TEXT
      ESCAPE ROUTINE
    END-NOREC
    IF TV-STATUS NE 'AP'
      MOVE 308 TO P-RC
      MOVE 'TRANSFER NOT APPROVED' TO P-RC-TEXT
      ESCAPE ROUTINE
    END-IF
*
    * DEDUCT FROM SOURCE
    COMPUTE P-QTY = TV-QTY * -1   /* NEGATIVE FOR OUTGOING */
    CALLNAT 'INVUPD' TV-PROD-ID TV-FROM-LOC-TYPE TV-FROM-LOC-ID
      'TRNS' P-QTY 'TRANSFER OUT' #INV-RC #INV-MSG
*
    IF #INV-RC NE 0
      MOVE #INV-RC TO P-RC
      MOVE #INV-MSG TO P-RC-TEXT
      ESCAPE ROUTINE
    END-IF
*
    GET TRN-VIEW *ISN (HOLD)
    MOVE 'SH' TO TV-STATUS
    MOVE *DATX TO TV-SHIP-DATE
    UPDATE TRN-VIEW
    END OF TRANSACTION
    ESCAPE BOTTOM
  END-FIND
END-SUBROUTINE
*
* -------------------------------------------------------
* RECEIVE TRANSFER - ADD TO DESTINATION
* -------------------------------------------------------
DEFINE SUBROUTINE RECEIVE-TRANSFER
  FIND TRN-VIEW WITH TV-ID = P-TRANSFER-ID
    IF NO RECORDS FOUND
      MOVE 308 TO P-RC
      MOVE 'TRANSFER NOT FOUND' TO P-RC-TEXT
      ESCAPE ROUTINE
    END-NOREC
    IF TV-STATUS NE 'SH'
      MOVE 308 TO P-RC
      MOVE 'TRANSFER NOT SHIPPED' TO P-RC-TEXT
      ESCAPE ROUTINE
    END-IF
*
    * ADD TO DESTINATION
    CALLNAT 'INVUPD' TV-PROD-ID TV-TO-LOC-TYPE TV-TO-LOC-ID
      'RCPT' TV-QTY 'TRANSFER IN' #INV-RC #INV-MSG
*
    GET TRN-VIEW *ISN (HOLD)
    MOVE 'RC' TO TV-STATUS
    MOVE *DATX TO TV-RECV-DATE
    UPDATE TRN-VIEW
    END OF TRANSACTION
    ESCAPE BOTTOM
  END-FIND
END-SUBROUTINE
*
* -------------------------------------------------------
* CANCEL TRANSFER
* -------------------------------------------------------
DEFINE SUBROUTINE CANCEL-TRANSFER
  FIND TRN-VIEW WITH TV-ID = P-TRANSFER-ID
    IF NO RECORDS FOUND
      MOVE 308 TO P-RC
      MOVE 'TRANSFER NOT FOUND' TO P-RC-TEXT
      ESCAPE ROUTINE
    END-NOREC
    IF TV-STATUS = 'RC' OR TV-STATUS = 'CA'
      MOVE 308 TO P-RC
      MOVE 'TRANSFER CANNOT BE CANCELLED' TO P-RC-TEXT
      ESCAPE ROUTINE
    END-IF
    GET TRN-VIEW *ISN (HOLD)
    MOVE 'CA' TO TV-STATUS
    UPDATE TRN-VIEW
    END OF TRANSACTION
    ESCAPE BOTTOM
  END-FIND
END-SUBROUTINE
*
END
