* >Natural Source Code: INVUPD
* SUBPROGRAM: INVUPD - INVENTORY UPDATE
* DESCRIPTION: UPDATES INVENTORY QUANTITIES FOR
*              RECEIPTS, SALES, AND ADJUSTMENTS
* LIBRARY: RETAILCORE
* ADABAS FILE: 105 (INVENTORY)
* CREATED: 1998-09-20  K. PATEL
* MODIFIED: 2003-02-15 - ADDED RECEIPT UPDATE
* MODIFIED: 2009-08-22 - ADDED DAMAGED TRACKING
* MODIFIED: 2016-04-10 - ADDED TRANSIT UPDATE
* MODIFIED: 2023-01-15 - ADDED VALIDATION ON NEGATIVE
* -------------------------------------------------------
DEFINE DATA
PARAMETER
  1 P-PROD-ID             (N8)
  1 P-LOC-TYPE            (A1)
  1 P-LOC-ID              (N4)
  1 P-UPDATE-TYPE         (A4)    /* RCPT SALE DMGD TRNS ADJT ALLC SELD */
  1 P-QTY                 (N8)    /* POSITIVE=ADD NEGATIVE=SUBTRACT */
  1 P-REASON              (A60)
  1 P-RC                  (N4)
  1 P-RC-TEXT             (A80)
*
LOCAL
  1 #USER-ID              (A8)
  1 #INV-STR              (A15)
  1 #OLD-ON-HAND          (N8)
  1 #NEW-ON-HAND          (N8)
*
  1 INV-UPD-VIEW VIEW OF INVENTORY-FILE
    2 IU-PROD-ID           (N8)
    2 IU-LOC-TYPE          (A1)
    2 IU-LOC-ID            (N4)
    2 IU-ON-HAND           (N8)
    2 IU-RESERVED          (N8)
    2 IU-ALLOCATED         (N8)
    2 IU-DAMAGED           (N8)
    2 IU-IN-TRANSIT        (N8)
    2 IU-AVAILABLE         (N8)
    2 IU-LAST-RECEIPT-DATE (D)
    2 IU-LAST-SOLD-DATE    (D)
END-DEFINE
*
MOVE *USER TO #USER-ID
RESET P-RC
*
FIND INV-UPD-VIEW WITH IU-PROD-ID = P-PROD-ID
    AND IU-LOC-TYPE = P-LOC-TYPE
    AND IU-LOC-ID = P-LOC-ID
  IF NO RECORDS FOUND
    * CREATE NEW INVENTORY RECORD IF RECEIPT
    IF P-UPDATE-TYPE = 'RCPT'
      PERFORM CREATE-INV-RECORD
    ELSE
      MOVE 300 TO P-RC
      MOVE 'INVENTORY RECORD NOT FOUND' TO P-RC-TEXT
    END-IF
    ESCAPE ROUTINE
  END-NOREC
*
  GET INV-UPD-VIEW *ISN (HOLD)
*
  ON ERROR
    IF *ERROR-NR = 145
      MOVE 305 TO P-RC
      MOVE 'INVENTORY RECORD LOCKED' TO P-RC-TEXT
      ESCAPE ROUTINE
    END-IF
  END-ERROR
*
  MOVE IU-ON-HAND TO #OLD-ON-HAND
*
  DECIDE ON FIRST VALUE OF P-UPDATE-TYPE
    VALUE 'RCPT'
      * RECEIPT - ADD TO ON-HAND
      ADD P-QTY TO IU-ON-HAND
      MOVE *DATX TO IU-LAST-RECEIPT-DATE
    VALUE 'SALE'
      * SALE - SUBTRACT FROM ON-HAND AND RESERVED
      SUBTRACT P-QTY FROM IU-ON-HAND
      SUBTRACT P-QTY FROM IU-RESERVED
      IF IU-RESERVED < 0
        MOVE 0 TO IU-RESERVED
      END-IF
      MOVE *DATX TO IU-LAST-SOLD-DATE
    VALUE 'DMGD'
      * DAMAGED - MOVE FROM ON-HAND TO DAMAGED
      ADD P-QTY TO IU-DAMAGED
      SUBTRACT P-QTY FROM IU-ON-HAND
    VALUE 'TRNS'
      * TRANSIT - ADJUST ON-HAND AND IN-TRANSIT
      * MODIFIED 2016-04-10
      IF P-QTY > 0
        * INCOMING - ADD TO IN-TRANSIT
        ADD P-QTY TO IU-IN-TRANSIT
      ELSE
        * OUTGOING - SUBTRACT FROM ON-HAND
        ADD P-QTY TO IU-ON-HAND  /* P-QTY IS NEGATIVE */
      END-IF
    VALUE 'ADJT'
      * ADJUSTMENT - DIRECT CHANGE TO ON-HAND
      ADD P-QTY TO IU-ON-HAND
    VALUE 'ALLC'
      * ALLOCATE - MOVE FROM RESERVED TO ALLOCATED
      ADD P-QTY TO IU-ALLOCATED
      SUBTRACT P-QTY FROM IU-RESERVED
      IF IU-RESERVED < 0
        MOVE 0 TO IU-RESERVED
      END-IF
    VALUE 'SELD'
      * SOLD/DISPATCHED - SUBTRACT FROM ALLOCATED
      SUBTRACT P-QTY FROM IU-ALLOCATED
      SUBTRACT P-QTY FROM IU-ON-HAND
      IF IU-ALLOCATED < 0
        MOVE 0 TO IU-ALLOCATED
      END-IF
    NONE VALUE
      MOVE 309 TO P-RC
      MOVE 'INVALID INVENTORY UPDATE TYPE' TO P-RC-TEXT
      BACKOUT TRANSACTION
      ESCAPE ROUTINE
  END-DECIDE
*
  * VALIDATION - NO NEGATIVE ON-HAND
  * MODIFIED 2023-01-15
  IF IU-ON-HAND < 0
    MOVE 304 TO P-RC
    COMPRESS 'WOULD RESULT IN NEGATIVE INVENTORY:'
      IU-ON-HAND INTO P-RC-TEXT
    BACKOUT TRANSACTION
    ESCAPE ROUTINE
  END-IF
*
  * RECALCULATE AVAILABLE
  COMPUTE IU-AVAILABLE = IU-ON-HAND - IU-RESERVED
    - IU-ALLOCATED - IU-DAMAGED
  IF IU-AVAILABLE < 0
    MOVE 0 TO IU-AVAILABLE
  END-IF
*
  UPDATE INV-UPD-VIEW
  ESCAPE BOTTOM
END-FIND
*
END OF TRANSACTION
*
MOVE #OLD-ON-HAND TO #NEW-ON-HAND
MOVE P-PROD-ID TO #INV-STR
CALLNAT 'AUDITN' 'INV' #INV-STR 'U' P-UPDATE-TYPE
  ' ' ' ' P-REASON
*
* -------------------------------------------------------
* CREATE NEW INVENTORY RECORD
* -------------------------------------------------------
DEFINE SUBROUTINE CREATE-INV-RECORD
  STORE INV-UPD-VIEW
    IU-PROD-ID          := P-PROD-ID
    IU-LOC-TYPE         := P-LOC-TYPE
    IU-LOC-ID           := P-LOC-ID
    IU-ON-HAND          := P-QTY
    IU-RESERVED         := 0
    IU-ALLOCATED        := 0
    IU-DAMAGED          := 0
    IU-IN-TRANSIT       := 0
    IU-AVAILABLE        := P-QTY
    IU-LAST-RECEIPT-DATE := *DATX
  END-STORE
*
  ON ERROR
    MOVE 300 TO P-RC
    MOVE 'FAILED TO CREATE INVENTORY RECORD' TO P-RC-TEXT
    ESCAPE ROUTINE
  END-ERROR
*
  END OF TRANSACTION
END-SUBROUTINE
*
END
