* >Natural Source Code: ORDGET
* SUBPROGRAM: ORDGET - ORDER RETRIEVAL
* DESCRIPTION: RETRIEVES COMPLETE ORDER WITH HEADER AND LINES
* LIBRARY: RETAILCORE
* ADABAS FILES: 111 (ORDER), 112 (ORDER-LINE)
* CREATED: 1998-10-10  A. GARCIA
* MODIFIED: 2007-02-18 - ADDED FINANCIAL SUMMARY
* MODIFIED: 2015-11-22 - ADDED ADDRESS RETRIEVAL
* -------------------------------------------------------
DEFINE DATA
PARAMETER
  1 P-ORDER-ID            (N10)
  1 P-ORDER-HEADER
    2 P-OH-ID             (N10)
    2 P-OH-NUMBER         (A12)
    2 P-OH-CUST-ID        (N8)
    2 P-OH-STORE-ID       (N4)
    2 P-OH-STATUS         (A3)
    2 P-OH-TYPE           (A2)
    2 P-OH-DATE           (D)
    2 P-OH-NUM-LINES      (N3)
    2 P-OH-SUBTOTAL       (N11.2)
    2 P-OH-DISCOUNT       (N9.2)
    2 P-OH-TAX            (N9.2)
    2 P-OH-TOTAL          (N11.2)
    2 P-OH-PAID           (N11.2)
    2 P-OH-CURRENCY       (A3)
  1 P-LINE-COUNT          (N3)
  1 P-LINES (20)
    2 P-LN-NO             (N3)
    2 P-LN-PROD-ID        (N8)
    2 P-LN-SKU            (A15)
    2 P-LN-DESC           (A60)
    2 P-LN-QTY            (N6)
    2 P-LN-PRICE          (N9.2)
    2 P-LN-DISCOUNT       (N9.2)
    2 P-LN-TAX            (N9.2)
    2 P-LN-TOTAL          (N11.2)
    2 P-LN-STATUS         (A3)
  1 P-FOUND-FLAG          (A1)
  1 P-ERROR-MSG           (A60)
*
LOCAL
  1 #LINE-IDX             (N3)
*
  1 OH-VIEW VIEW OF ORDER-FILE
    2 OG-ID                (N10)
    2 OG-NUMBER            (A12)
    2 OG-CUST-ID           (N8)
    2 OG-STORE-ID          (N4)
    2 OG-STATUS            (A3)
    2 OG-TYPE              (A2)
    2 OG-DATE              (D)
    2 OG-NUM-LINES         (N3)
    2 OG-SUBTOTAL          (N11.2)
    2 OG-DISCOUNT-AMT      (N9.2)
    2 OG-TAX-AMT           (N9.2)
    2 OG-TOTAL-AMT         (N11.2)
    2 OG-PAID-AMT          (N11.2)
    2 OG-CURRENCY          (A3)
*
  1 OL-GET-VIEW VIEW OF ORDER-LINE-FILE
    2 LG-ORDER-ID          (N10)
    2 LG-LINE-NO           (N3)
    2 LG-PROD-ID           (N8)
    2 LG-SKU               (A15)
    2 LG-DESCRIPTION       (A60)
    2 LG-QTY-ORDERED       (N6)
    2 LG-UNIT-PRICE        (N9.2)
    2 LG-DISCOUNT-AMT      (N9.2)
    2 LG-TAX-AMT           (N9.2)
    2 LG-LINE-TOTAL        (N11.2)
    2 LG-STATUS            (A3)
END-DEFINE
*
MOVE 'N' TO P-FOUND-FLAG
RESET P-ERROR-MSG
RESET P-LINE-COUNT
*
IF P-ORDER-ID = 0
  MOVE 'ORDER ID REQUIRED' TO P-ERROR-MSG
  ESCAPE ROUTINE
END-IF
*
* GET HEADER
FIND OH-VIEW WITH OG-ID = P-ORDER-ID
  IF NO RECORDS FOUND
    MOVE 'ORDER NOT FOUND' TO P-ERROR-MSG
    ESCAPE ROUTINE
  END-NOREC
  MOVE OG-ID           TO P-OH-ID
  MOVE OG-NUMBER       TO P-OH-NUMBER
  MOVE OG-CUST-ID      TO P-OH-CUST-ID
  MOVE OG-STORE-ID     TO P-OH-STORE-ID
  MOVE OG-STATUS       TO P-OH-STATUS
  MOVE OG-TYPE         TO P-OH-TYPE
  MOVE OG-DATE         TO P-OH-DATE
  MOVE OG-NUM-LINES    TO P-OH-NUM-LINES
  MOVE OG-SUBTOTAL     TO P-OH-SUBTOTAL
  MOVE OG-DISCOUNT-AMT TO P-OH-DISCOUNT
  MOVE OG-TAX-AMT      TO P-OH-TAX
  MOVE OG-TOTAL-AMT    TO P-OH-TOTAL
  MOVE OG-PAID-AMT     TO P-OH-PAID
  MOVE OG-CURRENCY     TO P-OH-CURRENCY
  ESCAPE BOTTOM
END-FIND
*
* GET LINES
RESET #LINE-IDX
READ OL-GET-VIEW BY LG-ORDER-ID = P-ORDER-ID
  IF LG-ORDER-ID NE P-ORDER-ID
    ESCAPE BOTTOM
  END-IF
  ADD 1 TO #LINE-IDX
  IF #LINE-IDX > 20
    ESCAPE BOTTOM
  END-IF
  MOVE LG-LINE-NO      TO P-LINES.P-LN-NO(#LINE-IDX)
  MOVE LG-PROD-ID      TO P-LINES.P-LN-PROD-ID(#LINE-IDX)
  MOVE LG-SKU          TO P-LINES.P-LN-SKU(#LINE-IDX)
  MOVE LG-DESCRIPTION  TO P-LINES.P-LN-DESC(#LINE-IDX)
  MOVE LG-QTY-ORDERED  TO P-LINES.P-LN-QTY(#LINE-IDX)
  MOVE LG-UNIT-PRICE   TO P-LINES.P-LN-PRICE(#LINE-IDX)
  MOVE LG-DISCOUNT-AMT TO P-LINES.P-LN-DISCOUNT(#LINE-IDX)
  MOVE LG-TAX-AMT      TO P-LINES.P-LN-TAX(#LINE-IDX)
  MOVE LG-LINE-TOTAL   TO P-LINES.P-LN-TOTAL(#LINE-IDX)
  MOVE LG-STATUS       TO P-LINES.P-LN-STATUS(#LINE-IDX)
END-READ
*
MOVE #LINE-IDX TO P-LINE-COUNT
MOVE 'Y' TO P-FOUND-FLAG
*
ON ERROR
  COMPRESS 'DB ERROR:' *ERROR-NR INTO P-ERROR-MSG
  CALLNAT 'LOGERR' 400 P-ERROR-MSG 'E' 'ORDGET' *USER
END-ERROR
*
END
