* >Natural Source Code: ORDLINE
* SUBPROGRAM: ORDLINE - ORDER LINE MANAGEMENT
* DESCRIPTION: ADD/UPDATE/CANCEL ORDER LINES
* LIBRARY: RETAILCORE
* ADABAS FILE: 112 (ORDER-LINE)
* CREATED: 1999-01-20  A. GARCIA
* MODIFIED: 2006-04-15 - ADDED LINE CANCEL
* MODIFIED: 2014-09-22 - ADDED QTY CHANGE WITH INV UPDATE
* MODIFIED: 2021-06-10 - ADDED GIFT FLAG
* -------------------------------------------------------
DEFINE DATA
PARAMETER
  1 P-OPERATION           (A4)    /* ADD UPD CANC */
  1 P-ORDER-ID            (N10)
  1 P-LINE-NO             (N3)
  1 P-PROD-ID             (N8)
  1 P-SKU                 (A15)
  1 P-QTY                 (N6)
  1 P-UNIT-PRICE          (N9.2)
  1 P-DISCOUNT            (N9.2)
  1 P-RC                  (N4)
  1 P-RC-TEXT             (A80)
*
LOCAL
  1 #USER-ID              (A8)
  1 #LINE-TOTAL           (N11.2)
  1 #TAX-RATE             (N5.4)  INIT <0.0825>
  1 #TAX-AMT              (N9.2)
  1 #OLD-QTY              (N6)
  1 #QTY-DIFF             (N6)
  1 #ORD-STR              (A15)
  1 #INV-RC               (N4)
  1 #INV-MSG              (A80)
*
  1 OL-MGMT-VIEW VIEW OF ORDER-LINE-FILE
    2 LM-ORDER-ID          (N10)
    2 LM-LINE-NO           (N3)
    2 LM-PROD-ID           (N8)
    2 LM-SKU               (A15)
    2 LM-DESCRIPTION       (A60)
    2 LM-QTY-ORDERED       (N6)
    2 LM-QTY-CANCELLED     (N6)
    2 LM-UNIT-PRICE        (N9.2)
    2 LM-ORIG-PRICE        (N9.2)
    2 LM-DISCOUNT-AMT      (N9.2)
    2 LM-TAX-AMT           (N9.2)
    2 LM-LINE-TOTAL        (N11.2)
    2 LM-STATUS            (A3)
    2 LM-PROMO-ID          (N8)
*
  1 ORD-UPD-VIEW VIEW OF ORDER-FILE
    2 OU-ID                (N10)
    2 OU-NUM-LINES         (N3)
    2 OU-SUBTOTAL          (N11.2)
    2 OU-DISCOUNT-AMT      (N9.2)
    2 OU-TAX-AMT           (N9.2)
    2 OU-TOTAL-AMT         (N11.2)
END-DEFINE
*
MOVE *USER TO #USER-ID
RESET P-RC
*
DECIDE ON FIRST VALUE OF P-OPERATION
  VALUE 'ADD'
    PERFORM ADD-LINE
  VALUE 'UPD'
    PERFORM UPDATE-LINE
  VALUE 'CANC'
    PERFORM CANCEL-LINE
  NONE VALUE
    MOVE 405 TO P-RC
    MOVE 'INVALID LINE OPERATION' TO P-RC-TEXT
END-DECIDE
*
DEFINE SUBROUTINE ADD-LINE
  * CALCULATE LINE TOTAL
  COMPUTE #TAX-AMT = (P-UNIT-PRICE * P-QTY - P-DISCOUNT) * #TAX-RATE
  COMPUTE #LINE-TOTAL = (P-UNIT-PRICE * P-QTY) - P-DISCOUNT + #TAX-AMT
*
  STORE OL-MGMT-VIEW
    LM-ORDER-ID    := P-ORDER-ID
    LM-LINE-NO     := P-LINE-NO
    LM-PROD-ID     := P-PROD-ID
    LM-SKU         := P-SKU
    LM-QTY-ORDERED := P-QTY
    LM-UNIT-PRICE  := P-UNIT-PRICE
    LM-ORIG-PRICE  := P-UNIT-PRICE
    LM-DISCOUNT-AMT := P-DISCOUNT
    LM-TAX-AMT     := #TAX-AMT
    LM-LINE-TOTAL  := #LINE-TOTAL
    LM-STATUS      := 'NEW'
  END-STORE
*
  * UPDATE ORDER HEADER TOTALS
  PERFORM UPDATE-ORDER-TOTALS
  END OF TRANSACTION
END-SUBROUTINE
*
DEFINE SUBROUTINE UPDATE-LINE
  FIND OL-MGMT-VIEW WITH LM-ORDER-ID = P-ORDER-ID
      AND LM-LINE-NO = P-LINE-NO
    IF NO RECORDS FOUND
      MOVE 405 TO P-RC
      MOVE 'ORDER LINE NOT FOUND' TO P-RC-TEXT
      ESCAPE ROUTINE
    END-NOREC
    MOVE LM-QTY-ORDERED TO #OLD-QTY
    GET OL-MGMT-VIEW *ISN (HOLD)
    IF P-QTY > 0
      MOVE P-QTY TO LM-QTY-ORDERED
      * RECALCULATE
      COMPUTE LM-TAX-AMT = (LM-UNIT-PRICE * P-QTY
        - LM-DISCOUNT-AMT) * #TAX-RATE
      COMPUTE LM-LINE-TOTAL = (LM-UNIT-PRICE * P-QTY)
        - LM-DISCOUNT-AMT + LM-TAX-AMT
    END-IF
    UPDATE OL-MGMT-VIEW
*
    * ADJUST INVENTORY IF QTY CHANGED
    COMPUTE #QTY-DIFF = P-QTY - #OLD-QTY
    IF #QTY-DIFF > 0
      * NEED MORE INVENTORY
      CALLNAT 'INVRES' P-ORDER-ID P-LINE-NO LM-PROD-ID LM-SKU
        'A' 0 #QTY-DIFF ' ' ' ' ' ' ' ' #INV-RC #INV-MSG
    ELSE IF #QTY-DIFF < 0
      * RELEASE EXCESS INVENTORY
      MULTIPLY #QTY-DIFF BY -1
      CALLNAT 'INVREL' 0 P-ORDER-ID #QTY-DIFF ' ' #INV-RC #INV-MSG
    END-IF
    END-IF
    ESCAPE BOTTOM
  END-FIND
  END OF TRANSACTION
END-SUBROUTINE
*
DEFINE SUBROUTINE CANCEL-LINE
  FIND OL-MGMT-VIEW WITH LM-ORDER-ID = P-ORDER-ID
      AND LM-LINE-NO = P-LINE-NO
    IF NO RECORDS FOUND
      MOVE 405 TO P-RC
      MOVE 'ORDER LINE NOT FOUND' TO P-RC-TEXT
      ESCAPE ROUTINE
    END-NOREC
    GET OL-MGMT-VIEW *ISN (HOLD)
    MOVE 'CAN' TO LM-STATUS
    MOVE LM-QTY-ORDERED TO LM-QTY-CANCELLED
    UPDATE OL-MGMT-VIEW
*
    * RELEASE INVENTORY
    CALLNAT 'INVREL' 0 P-ORDER-ID LM-QTY-ORDERED
      ' ' #INV-RC #INV-MSG
    ESCAPE BOTTOM
  END-FIND
  END OF TRANSACTION
END-SUBROUTINE
*
DEFINE SUBROUTINE UPDATE-ORDER-TOTALS
  * RECALCULATE ORDER HEADER FROM LINES
  FIND ORD-UPD-VIEW WITH OU-ID = P-ORDER-ID
    GET ORD-UPD-VIEW *ISN (HOLD)
    ADD 1 TO OU-NUM-LINES
    ADD #LINE-TOTAL TO OU-SUBTOTAL
    ADD P-DISCOUNT  TO OU-DISCOUNT-AMT
    ADD #TAX-AMT    TO OU-TAX-AMT
    COMPUTE OU-TOTAL-AMT = OU-SUBTOTAL
    UPDATE ORD-UPD-VIEW
    ESCAPE BOTTOM
  END-FIND
END-SUBROUTINE
*
END
