* >Natural Source Code: ORDVAL
* SUBPROGRAM: ORDVAL - ORDER VALIDATION
* DESCRIPTION: VALIDATES ORDER HEADER AND LINE DATA
* LIBRARY: RETAILCORE
* CREATED: 1998-10-05  A. GARCIA
* MODIFIED: 2005-09-15 - ADDED STORE VALIDATION
* MODIFIED: 2013-06-22 - ADDED MAX LINE CHECK
* MODIFIED: 2020-04-10 - ADDED ORDER TYPE VALIDATION
* -------------------------------------------------------
DEFINE DATA
PARAMETER
  1 P-CUST-ID             (N8)
  1 P-STORE-ID            (N4)
  1 P-ORDER-TYPE          (A2)
  1 P-NUM-LINES           (N3)
  1 P-VALID-FLAG          (A1)
  1 P-ERROR-MSG           (A60)
*
LOCAL
  1 #STORE-FOUND          (A1)
  1 #STORE-MSG            (A60)
  1 #STORE-STATUS         (A1)
  1 #STORE-NAME           (A40)
  1 #TAX-RATE             (N5.4)
  1 #MAX-LINES            (N3)    INIT <99>
  1 #CONFIG-VALUE         (A80)
  1 #CONFIG-NUM           (N11.2)
  1 #CONFIG-DATE          (D)
  1 #CONFIG-FLAG          (A1)
  1 #CONFIG-FOUND         (A1)
END-DEFINE
*
MOVE 'Y' TO P-VALID-FLAG
RESET P-ERROR-MSG
*
* VALIDATE CUSTOMER
IF P-CUST-ID = 0
  MOVE 'N' TO P-VALID-FLAG
  MOVE 'CUSTOMER ID IS REQUIRED' TO P-ERROR-MSG
  ESCAPE ROUTINE
END-IF
*
* VALIDATE ORDER TYPE
IF P-ORDER-TYPE NE 'ST' AND P-ORDER-TYPE NE 'WB'
    AND P-ORDER-TYPE NE 'PH' AND P-ORDER-TYPE NE 'MO'
  MOVE 'N' TO P-VALID-FLAG
  MOVE 'INVALID ORDER TYPE' TO P-ERROR-MSG
  ESCAPE ROUTINE
END-IF
*
* VALIDATE STORE (IF STORE ORDER)
IF P-ORDER-TYPE = 'ST' AND P-STORE-ID > 0
  CALLNAT 'STOREVAL'
    P-STORE-ID 'Y' 'N'
    #STORE-STATUS #STORE-NAME #TAX-RATE
    #STORE-FOUND #STORE-MSG
  IF #STORE-FOUND NE 'Y'
    MOVE 'N' TO P-VALID-FLAG
    MOVE #STORE-MSG TO P-ERROR-MSG
    ESCAPE ROUTINE
  END-IF
END-IF
*
* CHECK ORDER LINES
IF P-NUM-LINES = 0
  MOVE 'N' TO P-VALID-FLAG
  MOVE 'ORDER MUST HAVE AT LEAST ONE LINE' TO P-ERROR-MSG
  ESCAPE ROUTINE
END-IF
*
* CHECK MAX LINES
CALLNAT 'CONFIGN' 'MAX.ORDER.LINES'
  #CONFIG-VALUE #CONFIG-NUM #CONFIG-DATE #CONFIG-FLAG #CONFIG-FOUND
IF #CONFIG-FOUND = 'Y'
  MOVE #CONFIG-NUM TO #MAX-LINES
END-IF
IF P-NUM-LINES > #MAX-LINES
  MOVE 'N' TO P-VALID-FLAG
  COMPRESS 'EXCEEDS MAX ORDER LINES:' #MAX-LINES INTO P-ERROR-MSG
  ESCAPE ROUTINE
END-IF
*
END
