* >Natural Source Code: POCLOSE
* SUBPROGRAM: POCLOSE - PURCHASE ORDER CLOSE
* DESCRIPTION: CLOSES PO AFTER ALL RECEIPTS COMPLETE
*              CALCULATES VARIANCE, UPDATES SUPPLIER SPEND
* LIBRARY: RETAILCORE
* ADABAS FILES: 131 (PO-HEADER), 132 (PO-LINE)
* CREATED: 2002-03-15  A. GARCIA
* MODIFIED: 2011-08-22 - ADDED VARIANCE REPORTING
* MODIFIED: 2018-05-10 - ADDED AUTO-CLOSE BATCH
* -------------------------------------------------------
DEFINE DATA
PARAMETER
  1 P-PO-ID               (N10)
  1 P-FORCE-CLOSE         (A1)    /* Y=CLOSE EVEN IF PARTIAL */
  1 P-VARIANCE
    2 P-VAR-QTY-ORD       (N8)
    2 P-VAR-QTY-RCV       (N8)
    2 P-VAR-QTY-DIFF      (N8)
    2 P-VAR-AMT-ORD       (N11.2)
    2 P-VAR-AMT-RCV       (N11.2)
    2 P-VAR-AMT-DIFF      (N11.2)
    2 P-VAR-LINES-SHORT   (N3)
  1 P-RC                  (N4)
  1 P-RC-TEXT             (A80)
*
LOCAL
  1 #USER-ID              (A8)
  1 #SUPP-ID              (N8)
  1 #PO-TOTAL             (N11.2)
  1 #VALID-FLAG           (A1)
  1 #ERROR-MSG            (A60)
  1 #ORD-STR              (A15)
  1 #VAR-STR              (A40)
*
  1 PCH-VIEW VIEW OF PO-HEADER-FILE
    2 PCH-ID               (N10)
    2 PCH-STATUS           (A2)
    2 PCH-SUPP-ID          (N8)
    2 PCH-TOTAL-AMT        (N11.2)
*
  1 PCL-VIEW VIEW OF PO-LINE-FILE
    2 PCL-PO-ID            (N10)
    2 PCL-QTY-ORDERED      (N6)
    2 PCL-QTY-RECEIVED     (N6)
    2 PCL-UNIT-COST        (N9.2)
    2 PCL-LINE-TOTAL       (N11.2)
    2 PCL-STATUS           (A2)
END-DEFINE
*
MOVE *USER TO #USER-ID
RESET P-RC
RESET P-RC-TEXT
RESET P-VARIANCE
*
* GET PO
FIND PCH-VIEW WITH PCH-ID = P-PO-ID
  IF NO RECORDS FOUND
    MOVE 604 TO P-RC
    MOVE 'PURCHASE ORDER NOT FOUND' TO P-RC-TEXT
    ESCAPE ROUTINE
  END-NOREC
  IF PCH-STATUS = 'CL'
    MOVE 610 TO P-RC
    MOVE 'PO ALREADY CLOSED' TO P-RC-TEXT
    ESCAPE ROUTINE
  END-IF
  IF PCH-STATUS = 'CA'
    MOVE 611 TO P-RC
    MOVE 'CANCELLED PO CANNOT BE CLOSED' TO P-RC-TEXT
    ESCAPE ROUTINE
  END-IF
  IF PCH-STATUS NE 'RC' AND PCH-STATUS NE 'PR'
    IF P-FORCE-CLOSE NE 'Y'
      MOVE 612 TO P-RC
      COMPRESS 'PO STATUS' PCH-STATUS 'NOT CLOSEABLE'
        INTO P-RC-TEXT
      ESCAPE ROUTINE
    END-IF
  END-IF
  MOVE PCH-SUPP-ID   TO #SUPP-ID
  MOVE PCH-TOTAL-AMT TO #PO-TOTAL
  ESCAPE BOTTOM
END-FIND
*
* CALCULATE VARIANCE
FIND PCL-VIEW WITH PCL-PO-ID = P-PO-ID
  ADD PCL-QTY-ORDERED  TO P-VAR-QTY-ORD
  ADD PCL-QTY-RECEIVED TO P-VAR-QTY-RCV
  ADD PCL-LINE-TOTAL   TO P-VAR-AMT-ORD
*
  1 #RCV-AMT (N11.2)
  COMPUTE #RCV-AMT = PCL-QTY-RECEIVED * PCL-UNIT-COST
  ADD #RCV-AMT TO P-VAR-AMT-RCV
*
  IF PCL-QTY-RECEIVED < PCL-QTY-ORDERED
    ADD 1 TO P-VAR-LINES-SHORT
  END-IF
END-FIND
*
COMPUTE P-VAR-QTY-DIFF = P-VAR-QTY-ORD - P-VAR-QTY-RCV
COMPUTE P-VAR-AMT-DIFF = P-VAR-AMT-ORD - P-VAR-AMT-RCV
*
* CHECK IF PARTIAL AND NOT FORCED
IF P-VAR-QTY-DIFF > 0 AND P-FORCE-CLOSE NE 'Y'
  MOVE 615 TO P-RC
  COMPRESS P-VAR-LINES-SHORT 'LINES HAVE SHORTAGES -'
    'USE FORCE-CLOSE TO CLOSE ANYWAY' INTO P-RC-TEXT
  ESCAPE ROUTINE
END-IF
*
* CLOSE PO
CALLNAT 'POVAL' P-PO-ID 'CLOS' #USER-ID
  #VALID-FLAG #ERROR-MSG
IF #VALID-FLAG NE 'Y'
  * TRY RECEIVE FIRST THEN CLOSE
  CALLNAT 'POVAL' P-PO-ID 'RECV' #USER-ID
    #VALID-FLAG #ERROR-MSG
  IF #VALID-FLAG = 'Y'
    CALLNAT 'POVAL' P-PO-ID 'CLOS' #USER-ID
      #VALID-FLAG #ERROR-MSG
  END-IF
  IF #VALID-FLAG NE 'Y'
    MOVE 620 TO P-RC
    MOVE #ERROR-MSG TO P-RC-TEXT
    ESCAPE ROUTINE
  END-IF
END-IF
*
* UPDATE SUPPLIER SPEND
CALLNAT 'SUPPUPD' #SUPP-ID 'PO' ' '
  P-VAR-AMT-RCV 0 0 *DATX 0 ' '
*
* AUDIT
MOVE P-PO-ID TO #ORD-STR
COMPRESS 'ORD:' P-VAR-QTY-ORD 'RCV:' P-VAR-QTY-RCV
  'DIFF:' P-VAR-QTY-DIFF INTO #VAR-STR
CALLNAT 'AUDITN' 'PO' #ORD-STR 'U' 'CLOSE'
  ' ' ' ' #VAR-STR
*
END
