* >Natural Source Code: RETGET
* SUBPROGRAM: RETGET - RETURN RETRIEVAL
* DESCRIPTION: RETRIEVES COMPLETE RETURN WITH HEADER AND LINES
* LIBRARY: RETAILCORE
* ADABAS FILES: 150 (RETURN), 151 (RETURN-LINE)
* CREATED: 2003-05-20  A. GARCIA
* MODIFIED: 2012-03-15 - ADDED INSPECTION DATA
* -------------------------------------------------------
DEFINE DATA
PARAMETER
  1 P-RETURN-ID           (N10)
  1 P-RET-HEADER
    2 P-RH-ID             (N10)
    2 P-RH-NUMBER         (A15)
    2 P-RH-ORDER-ID       (N10)
    2 P-RH-CUST-ID        (N8)
    2 P-RH-STORE-ID       (N4)
    2 P-RH-STATUS         (A3)
    2 P-RH-TYPE           (A2)
    2 P-RH-REASON         (A4)
    2 P-RH-NUM-LINES      (N3)
    2 P-RH-TOTAL          (N11.2)
    2 P-RH-REFUND-METHOD  (A2)
    2 P-RH-DATE           (D)
    2 P-RH-CREATED-BY     (A8)
  1 P-LINE-COUNT          (N3)
  1 P-LINES (20)
    2 P-RL-LINE-NO        (N3)
    2 P-RL-ORD-LINE-NO    (N3)
    2 P-RL-PROD-ID        (N8)
    2 P-RL-SKU            (A15)
    2 P-RL-QTY            (N6)
    2 P-RL-REASON         (A4)
    2 P-RL-CONDITION      (A1)
    2 P-RL-UNIT-PRICE     (N9.2)
    2 P-RL-REFUND-AMT     (N11.2)
    2 P-RL-STATUS         (A3)
  1 P-FOUND-FLAG          (A1)
  1 P-ERROR-MSG           (A60)
*
LOCAL
  1 #IDX                  (N3)
*
  1 RGH-VIEW VIEW OF RETURN-FILE
    2 RGH-ID               (N10)
    2 RGH-NUMBER           (A15)
    2 RGH-ORDER-ID         (N10)
    2 RGH-CUST-ID          (N8)
    2 RGH-STORE-ID         (N4)
    2 RGH-STATUS           (A3)
    2 RGH-TYPE             (A2)
    2 RGH-REASON-CODE      (A4)
    2 RGH-NUM-LINES        (N3)
    2 RGH-TOTAL-AMT        (N11.2)
    2 RGH-REFUND-METHOD    (A2)
    2 RGH-DATE             (D)
    2 RGH-CREATED-BY       (A8)
*
  1 RGL-VIEW VIEW OF RETURN-LINE-FILE
    2 RGL-RETURN-ID        (N10)
    2 RGL-LINE-NO          (N3)
    2 RGL-ORDER-LINE-NO    (N3)
    2 RGL-PROD-ID          (N8)
    2 RGL-SKU              (A15)
    2 RGL-QTY-RETURNED     (N6)
    2 RGL-REASON-CODE      (A4)
    2 RGL-CONDITION        (A1)
    2 RGL-UNIT-PRICE       (N9.2)
    2 RGL-REFUND-AMT       (N11.2)
    2 RGL-STATUS           (A3)
END-DEFINE
*
MOVE 'N' TO P-FOUND-FLAG
RESET P-ERROR-MSG
RESET P-LINE-COUNT
*
* GET HEADER
FIND RGH-VIEW WITH RGH-ID = P-RETURN-ID
  IF NO RECORDS FOUND
    MOVE 'RETURN NOT FOUND' TO P-ERROR-MSG
    ESCAPE ROUTINE
  END-NOREC
  MOVE RGH-ID            TO P-RH-ID
  MOVE RGH-NUMBER        TO P-RH-NUMBER
  MOVE RGH-ORDER-ID      TO P-RH-ORDER-ID
  MOVE RGH-CUST-ID       TO P-RH-CUST-ID
  MOVE RGH-STORE-ID      TO P-RH-STORE-ID
  MOVE RGH-STATUS        TO P-RH-STATUS
  MOVE RGH-TYPE          TO P-RH-TYPE
  MOVE RGH-REASON-CODE   TO P-RH-REASON
  MOVE RGH-NUM-LINES     TO P-RH-NUM-LINES
  MOVE RGH-TOTAL-AMT     TO P-RH-TOTAL
  MOVE RGH-REFUND-METHOD TO P-RH-REFUND-METHOD
  MOVE RGH-DATE          TO P-RH-DATE
  MOVE RGH-CREATED-BY    TO P-RH-CREATED-BY
  ESCAPE BOTTOM
END-FIND
*
* GET LINES
RESET #IDX
READ RGL-VIEW BY RGL-RETURN-ID = P-RETURN-ID
  IF RGL-RETURN-ID NE P-RETURN-ID
    ESCAPE BOTTOM
  END-IF
  ADD 1 TO #IDX
  IF #IDX > 20
    ESCAPE BOTTOM
  END-IF
  MOVE RGL-LINE-NO       TO P-LINES.P-RL-LINE-NO(#IDX)
  MOVE RGL-ORDER-LINE-NO TO P-LINES.P-RL-ORD-LINE-NO(#IDX)
  MOVE RGL-PROD-ID       TO P-LINES.P-RL-PROD-ID(#IDX)
  MOVE RGL-SKU           TO P-LINES.P-RL-SKU(#IDX)
  MOVE RGL-QTY-RETURNED  TO P-LINES.P-RL-QTY(#IDX)
  MOVE RGL-REASON-CODE   TO P-LINES.P-RL-REASON(#IDX)
  MOVE RGL-CONDITION     TO P-LINES.P-RL-CONDITION(#IDX)
  MOVE RGL-UNIT-PRICE    TO P-LINES.P-RL-UNIT-PRICE(#IDX)
  MOVE RGL-REFUND-AMT    TO P-LINES.P-RL-REFUND-AMT(#IDX)
  MOVE RGL-STATUS        TO P-LINES.P-RL-STATUS(#IDX)
END-READ
*
MOVE #IDX TO P-LINE-COUNT
MOVE 'Y' TO P-FOUND-FLAG
*
END
