* >Natural Source Code: SHIPENTR
* SUBPROGRAM: SHIPENTR - SHIPMENT CREATION
* DESCRIPTION: CREATES SHIPMENT RECORDS FOR ALLOCATED ORDERS
*              ASSIGNS CARRIER, GENERATES TRACKING
*              TRIGGERS PAYMENT CAPTURE
* LIBRARY: RETAILCORE
* ADABAS FILES: 141 (SHIPMENT), 142 (SHIPMENT-LINE)
* CREATED: 2006-03-15  S. MARTINEZ
* MODIFIED: 2012-10-22 - ADDED CARRIER SELECTION
* MODIFIED: 2018-05-10 - ADDED SPLIT SHIPMENT
* MODIFIED: 2023-09-15 - ADDED SHIP-FROM-STORE
* -------------------------------------------------------
DEFINE DATA
PARAMETER
  1 P-ORDER-ID            (N10)
  1 P-CARRIER-CODE        (A4)    /* UPS FDX USPS DHL */
  1 P-SERVICE-LEVEL       (A2)    /* GR=GROUND EX=EXPRESS ON=OVERNIGHT */
  1 P-SHIP-ID             (N10)
  1 P-TRACKING-NO         (A30)
  1 P-RC                  (N4)
  1 P-RC-TEXT             (A80)
*
LOCAL
  1 #USER-ID              (A8)
  1 #TODAY                (D)
  1 #NEW-SHIP-ID          (N10)
  1 #LINE-COUNT           (N3)
  1 #TOTAL-QTY            (N6)
  1 #PAY-RC               (N4)
  1 #PAY-MSG              (A80)
  1 #POST-FLAG            (A1)
  1 #POST-MSG             (A60)
  1 #ORD-STR              (A15)
*
* SHIPMENT ADDRESS (FROM ORDER)
  1 #SHIP-ADDR
    2 #SA-NAME            (A40)
    2 #SA-LINE1           (A40)
    2 #SA-LINE2           (A40)
    2 #SA-CITY            (A30)
    2 #SA-STATE           (A2)
    2 #SA-ZIP             (A10)
    2 #SA-COUNTRY         (A3)
*
  1 SOV-VIEW VIEW OF ORDER-FILE
    2 SOV-ID               (N10)
    2 SOV-STATUS           (A3)
    2 SOV-STORE-ID         (N4)
    2 SOV-TOTAL-AMT        (N11.2)
*
  1 SFA-VIEW VIEW OF FULFILLMENT-ALLOC-FILE
    2 SFA-ORDER-ID         (N10)
    2 SFA-LINE-NO          (N3)
    2 SFA-LOCATION-ID      (N6)
    2 SFA-QTY-ALLOCATED    (N6)
    2 SFA-STATUS           (A2)
*
  1 SHP-VIEW VIEW OF SHIPMENT-FILE
    2 SHP-ID               (N10)
    2 SHP-ORDER-ID         (N10)
    2 SHP-CARRIER          (A4)
    2 SHP-SERVICE          (A2)
    2 SHP-TRACKING-NO      (A30)
    2 SHP-STATUS           (A2)    /* CR=CREATED PK=PICKED PD=PACKED SH=SHIPPED DL=DELIVERED */
    2 SHP-SHIP-DATE        (D)
    2 SHP-NUM-ITEMS        (N6)
    2 SHP-WEIGHT           (N7.2)
    2 SHP-COST             (N9.2)
    2 SHP-SHIP-FROM-ID     (N6)
    2 SHP-SHIP-FROM-TYPE   (A1)
    2 SHP-CREATED-BY       (A8)
    2 SHP-CREATED-DATE     (D)
*
  1 SHL-VIEW VIEW OF SHIPMENT-LINE-FILE
    2 SHL-SHIP-ID          (N10)
    2 SHL-ORDER-ID         (N10)
    2 SHL-LINE-NO          (N3)
    2 SHL-PROD-ID          (N8)
    2 SHL-SKU              (A15)
    2 SHL-QTY              (N6)
    2 SHL-STATUS           (A2)
END-DEFINE
*
MOVE *USER TO #USER-ID
MOVE *DATX TO #TODAY
RESET P-RC
RESET P-RC-TEXT
RESET #LINE-COUNT
RESET #TOTAL-QTY
*
* VALIDATE CARRIER
IF P-CARRIER-CODE NE 'UPS' AND P-CARRIER-CODE NE 'FDX'
    AND P-CARRIER-CODE NE 'USPS' AND P-CARRIER-CODE NE 'DHL'
  MOVE 'UPS' TO P-CARRIER-CODE
END-IF
IF P-SERVICE-LEVEL = ' '
  MOVE 'GR' TO P-SERVICE-LEVEL
END-IF
*
* CHECK ORDER STATUS
FIND SOV-VIEW WITH SOV-ID = P-ORDER-ID
  IF NO RECORDS FOUND
    MOVE 804 TO P-RC
    MOVE 'ORDER NOT FOUND' TO P-RC-TEXT
    ESCAPE ROUTINE
  END-NOREC
  IF SOV-STATUS NE 'ALC' AND SOV-STATUS NE 'PAD'
    MOVE 810 TO P-RC
    COMPRESS 'ORDER STATUS' SOV-STATUS 'NOT SHIPPABLE' INTO P-RC-TEXT
    ESCAPE ROUTINE
  END-IF
  ESCAPE BOTTOM
END-FIND
*
* CREATE SHIPMENT
CALLNAT 'SEQNON' 'SHIP' #NEW-SHIP-ID
*
* GENERATE TRACKING NUMBER
COMPRESS P-CARRIER-CODE '-' #NEW-SHIP-ID '-' *TIMESTMP
  INTO P-TRACKING-NO LEAVING NO SPACE
*
* GET ALLOCATION INFO FOR SHIP-FROM
1 #FIRST-LOC (N6)
1 #FIRST-TYPE (A1)
FIND SFA-VIEW WITH SFA-ORDER-ID = P-ORDER-ID
  IF SFA-STATUS = 'AL'
    MOVE SFA-LOCATION-ID TO #FIRST-LOC
    ESCAPE BOTTOM
  END-IF
END-FIND
MOVE 'W' TO #FIRST-TYPE
*
STORE SHP-VIEW
  SHP-ID             := #NEW-SHIP-ID
  SHP-ORDER-ID       := P-ORDER-ID
  SHP-CARRIER        := P-CARRIER-CODE
  SHP-SERVICE        := P-SERVICE-LEVEL
  SHP-TRACKING-NO    := P-TRACKING-NO
  SHP-STATUS         := 'CR'
  SHP-SHIP-DATE      := #TODAY
  SHP-SHIP-FROM-ID   := #FIRST-LOC
  SHP-SHIP-FROM-TYPE := #FIRST-TYPE
  SHP-CREATED-BY     := #USER-ID
  SHP-CREATED-DATE   := #TODAY
END-STORE
*
* CREATE SHIPMENT LINES FROM ALLOCATIONS
FIND SFA-VIEW WITH SFA-ORDER-ID = P-ORDER-ID
  IF SFA-STATUS NE 'AL'
    ESCAPE TOP
  END-IF
*
  ADD 1 TO #LINE-COUNT
  ADD SFA-QTY-ALLOCATED TO #TOTAL-QTY
*
  STORE SHL-VIEW
    SHL-SHIP-ID   := #NEW-SHIP-ID
    SHL-ORDER-ID  := P-ORDER-ID
    SHL-LINE-NO   := SFA-LINE-NO
    SHL-QTY       := SFA-QTY-ALLOCATED
    SHL-STATUS    := 'CR'
  END-STORE
*
  * UPDATE ALLOCATION STATUS
  GET SFA-VIEW *ISN (HOLD)
  MOVE 'SH' TO SFA-STATUS
  UPDATE SFA-VIEW
*
END-FIND
*
* UPDATE SHIPMENT ITEM COUNT
FIND SHP-VIEW WITH SHP-ID = #NEW-SHIP-ID
  GET SHP-VIEW *ISN (HOLD)
  MOVE #TOTAL-QTY TO SHP-NUM-ITEMS
  UPDATE SHP-VIEW
  ESCAPE BOTTOM
END-FIND
*
END OF TRANSACTION
*
MOVE #NEW-SHIP-ID TO P-SHIP-ID
*
* TRIGGER PAYMENT CAPTURE (IF NOT ALREADY CAPTURED)
FIND PAY-VIEW VIEW OF PAYMENT-FILE
    WITH PAY-ORDER-ID = P-ORDER-ID
  REDEFINE PAY-VIEW
    2 PAY-ORDER-ID (N10)
    2 PAY-STATUS   (A2)
    2 PAY-ID       (N10)
  END-REDEFINE
  IF PAY-STATUS = 'AU'
    CALLNAT 'PAYCAP' PAY-ID 0 #PAY-RC #PAY-MSG
    IF #PAY-RC NE 0
      CALLNAT 'LOGERR' 720 #PAY-MSG 'W' 'SHIPENTR' #USER-ID
    END-IF
    ESCAPE BOTTOM
  END-IF
END-FIND
*
* UPDATE ORDER STATUS TO SHIPPED
CALLNAT 'ORDPOST' P-ORDER-ID 'SHP' #POST-FLAG #POST-MSG
*
* AUDIT
MOVE P-ORDER-ID TO #ORD-STR
CALLNAT 'AUDITN' 'SHIP' #ORD-STR 'C' 'SHIP'
  ' ' P-TRACKING-NO 'SHIPMENT CREATED'
*
END
