* >Natural Source Code: STOREPRICE
* SUBPROGRAM: STOREPRICE - STORE PRICE MANAGEMENT
* DESCRIPTION: MANAGES STORE-SPECIFIC PRICE OVERRIDES
*              SET, UPDATE, EXPIRE STORE PRICES
* LIBRARY: RETAILCORE
* ADABAS FILE: 120 (STORE-PRICE)
* CREATED: 2002-04-15  A. GARCIA
* MODIFIED: 2008-09-22 - ADDED EFFECTIVE DATE VALIDATION
* MODIFIED: 2015-03-10 - ADDED BULK PRICE UPDATE
* MODIFIED: 2021-07-15 - ADDED PRICE HISTORY
* -------------------------------------------------------
DEFINE DATA
PARAMETER
  1 P-OPERATION           (A4)    /* GET SET UPD EXP BULK */
  1 P-PROD-ID             (N8)
  1 P-STORE-ID            (N4)
  1 P-PRICE               (N9.2)
  1 P-EFF-FROM            (D)
  1 P-EFF-TO              (D)
  1 P-REASON              (A4)
  1 P-RC                  (N4)
  1 P-RC-TEXT             (A80)
*
LOCAL
  1 #USER-ID              (A8)
  1 #TODAY                (D)
  1 #OLD-PRICE            (N9.2)
  1 #FOUND                (A1)
  1 #BASE-PRICE           (N9.2)
  1 #MIN-PRICE            (N9.2)
  1 #COST-PRICE           (N9.2)
  1 #ORD-STR              (A15)
  1 #PRICE-STR            (A20)
  1 #OLD-STR              (A20)
*
  1 STP-VIEW VIEW OF STORE-PRICE-FILE
    2 STP-PROD-ID          (N8)
    2 STP-STORE-ID         (N4)
    2 STP-PRICE            (N9.2)
    2 STP-EFF-FROM         (D)
    2 STP-EFF-TO           (D)
    2 STP-REASON           (A4)
    2 STP-CREATED-BY       (A8)
    2 STP-CREATED-DATE     (D)
    2 STP-MODIFIED-BY      (A8)
    2 STP-MODIFIED-DATE    (D)
*
  1 PRD-VIEW VIEW OF PRODUCT-FILE
    2 PRD-ID               (N8)
    2 PRD-BASE-PRICE       (N9.2)
    2 PRD-MIN-PRICE        (N9.2)
    2 PRD-COST-PRICE       (N9.2)
END-DEFINE
*
MOVE *USER TO #USER-ID
MOVE *DATX TO #TODAY
RESET P-RC
RESET P-RC-TEXT
*
DECIDE ON FIRST VALUE OF P-OPERATION
  VALUE 'GET'
    PERFORM GET-STORE-PRICE
  VALUE 'SET'
    PERFORM SET-STORE-PRICE
  VALUE 'UPD'
    PERFORM UPDATE-STORE-PRICE
  VALUE 'EXP'
    PERFORM EXPIRE-STORE-PRICE
  NONE VALUE
    MOVE 405 TO P-RC
    MOVE 'INVALID PRICE OPERATION' TO P-RC-TEXT
END-DECIDE
*
* -------------------------------------------------------
DEFINE SUBROUTINE GET-STORE-PRICE
  MOVE 'N' TO #FOUND
  FIND STP-VIEW WITH STP-PROD-ID = P-PROD-ID
      AND STP-STORE-ID = P-STORE-ID
    IF NO RECORDS FOUND
      MOVE 404 TO P-RC
      MOVE 'NO STORE PRICE FOUND' TO P-RC-TEXT
      ESCAPE ROUTINE
    END-NOREC
    * GET CURRENT EFFECTIVE PRICE
    IF STP-EFF-FROM <= #TODAY AND STP-EFF-TO >= #TODAY
      MOVE STP-PRICE    TO P-PRICE
      MOVE STP-EFF-FROM TO P-EFF-FROM
      MOVE STP-EFF-TO   TO P-EFF-TO
      MOVE 'Y' TO #FOUND
      ESCAPE BOTTOM
    END-IF
  END-FIND
  IF #FOUND NE 'Y'
    MOVE 404 TO P-RC
    MOVE 'NO ACTIVE STORE PRICE FOUND' TO P-RC-TEXT
  END-IF
END-SUBROUTINE
*
* -------------------------------------------------------
DEFINE SUBROUTINE SET-STORE-PRICE
  * VALIDATE PRODUCT EXISTS
  FIND PRD-VIEW WITH PRD-ID = P-PROD-ID
    IF NO RECORDS FOUND
      MOVE 404 TO P-RC
      MOVE 'PRODUCT NOT FOUND' TO P-RC-TEXT
      ESCAPE ROUTINE
    END-NOREC
    MOVE PRD-BASE-PRICE TO #BASE-PRICE
    MOVE PRD-MIN-PRICE  TO #MIN-PRICE
    MOVE PRD-COST-PRICE TO #COST-PRICE
    ESCAPE BOTTOM
  END-FIND
*
  * VALIDATE PRICE
  IF P-PRICE <= 0
    MOVE 501 TO P-RC
    MOVE 'PRICE MUST BE GREATER THAN ZERO' TO P-RC-TEXT
    ESCAPE ROUTINE
  END-IF
  IF #MIN-PRICE > 0 AND P-PRICE < #MIN-PRICE
    MOVE 502 TO P-RC
    COMPRESS 'PRICE BELOW MINIMUM:' #MIN-PRICE INTO P-RC-TEXT
    ESCAPE ROUTINE
  END-IF
  IF #COST-PRICE > 0 AND P-PRICE < #COST-PRICE
    MOVE 503 TO P-RC
    MOVE 'PRICE BELOW COST - REQUIRES OVERRIDE' TO P-RC-TEXT
    ESCAPE ROUTINE
  END-IF
*
  * VALIDATE DATES
  IF P-EFF-FROM = 0
    MOVE #TODAY TO P-EFF-FROM
  END-IF
  IF P-EFF-TO = 0
    * DEFAULT: 1 YEAR FROM START
    MOVE P-EFF-FROM TO P-EFF-TO
    ADD 365 TO P-EFF-TO (D)
  END-IF
  IF P-EFF-FROM > P-EFF-TO
    MOVE 504 TO P-RC
    MOVE 'FROM DATE MUST BE BEFORE TO DATE' TO P-RC-TEXT
    ESCAPE ROUTINE
  END-IF
*
  * CHECK FOR EXISTING PRICE
  FIND STP-VIEW WITH STP-PROD-ID = P-PROD-ID
      AND STP-STORE-ID = P-STORE-ID
    IF NO RECORDS FOUND
      IGNORE
    END-NOREC
    * EXPIRE EXISTING IF OVERLAPPING
    IF STP-EFF-TO >= P-EFF-FROM
      GET STP-VIEW *ISN (HOLD)
      MOVE P-EFF-FROM TO STP-EFF-TO
      SUBTRACT 1 FROM STP-EFF-TO (D)
      UPDATE STP-VIEW
    END-IF
  END-FIND
*
  * CREATE NEW STORE PRICE
  STORE STP-VIEW
    STP-PROD-ID       := P-PROD-ID
    STP-STORE-ID      := P-STORE-ID
    STP-PRICE         := P-PRICE
    STP-EFF-FROM      := P-EFF-FROM
    STP-EFF-TO        := P-EFF-TO
    STP-REASON        := P-REASON
    STP-CREATED-BY    := #USER-ID
    STP-CREATED-DATE  := #TODAY
    STP-MODIFIED-BY   := #USER-ID
    STP-MODIFIED-DATE := #TODAY
  END-STORE
*
  END OF TRANSACTION
*
  * AUDIT
  MOVE P-PRICE TO #PRICE-STR
  MOVE #BASE-PRICE TO #OLD-STR
  COMPRESS P-PROD-ID '/' P-STORE-ID INTO #ORD-STR
  CALLNAT 'AUDITN' 'PRIC' #ORD-STR 'C' 'STORE'
    #OLD-STR #PRICE-STR 'STORE PRICE SET'
*
END-SUBROUTINE
*
* -------------------------------------------------------
DEFINE SUBROUTINE UPDATE-STORE-PRICE
  FIND STP-VIEW WITH STP-PROD-ID = P-PROD-ID
      AND STP-STORE-ID = P-STORE-ID
    IF NO RECORDS FOUND
      MOVE 404 TO P-RC
      MOVE 'STORE PRICE NOT FOUND' TO P-RC-TEXT
      ESCAPE ROUTINE
    END-NOREC
    IF STP-EFF-TO < #TODAY
      ESCAPE TOP
    END-IF
    MOVE STP-PRICE TO #OLD-PRICE
    GET STP-VIEW *ISN (HOLD)
    MOVE P-PRICE TO STP-PRICE
    IF P-EFF-TO > 0
      MOVE P-EFF-TO TO STP-EFF-TO
    END-IF
    MOVE #USER-ID TO STP-MODIFIED-BY
    MOVE #TODAY TO STP-MODIFIED-DATE
    UPDATE STP-VIEW
    END OF TRANSACTION
    ESCAPE BOTTOM
  END-FIND
END-SUBROUTINE
*
* -------------------------------------------------------
DEFINE SUBROUTINE EXPIRE-STORE-PRICE
  FIND STP-VIEW WITH STP-PROD-ID = P-PROD-ID
      AND STP-STORE-ID = P-STORE-ID
    IF NO RECORDS FOUND
      MOVE 404 TO P-RC
      MOVE 'STORE PRICE NOT FOUND' TO P-RC-TEXT
      ESCAPE ROUTINE
    END-NOREC
    IF STP-EFF-TO < #TODAY
      ESCAPE TOP
    END-IF
    GET STP-VIEW *ISN (HOLD)
    MOVE #TODAY TO STP-EFF-TO
    MOVE #USER-ID TO STP-MODIFIED-BY
    MOVE #TODAY TO STP-MODIFIED-DATE
    UPDATE STP-VIEW
    END OF TRANSACTION
    ESCAPE BOTTOM
  END-FIND
END-SUBROUTINE
*
END
