* >Natural Source Code: STOREUPD
* SUBPROGRAM: STOREUPD - STORE UPDATE
* DESCRIPTION: UPDATES STORE MASTER DATA
* LIBRARY: RETAILCORE
* ADABAS FILE: 103 (STORE)
* CREATED: 1998-08-10  D. CHEN
* MODIFIED: 2012-05-18 - ADDED SHIP-FROM-STORE
* MODIFIED: 2020-02-28 - ADDED BOPIS CAPABILITY
* -------------------------------------------------------
DEFINE DATA
PARAMETER
  1 P-STORE-ID            (N4)
  1 P-UPDATE-TYPE         (A4)    /* STAT NAME ADDR OPS */
  1 P-NEW-STATUS          (A1)
  1 P-NEW-NAME            (A40)
  1 P-FULFILL-CAP         (A1)
  1 P-SHIP-FROM           (A1)
  1 P-PICKUP              (A1)
  1 P-RC                  (N4)
  1 P-RC-TEXT             (A80)
*
LOCAL
  1 #USER-ID              (A8)
  1 #STORE-STR            (A15)
*
  1 STORE-UPD VIEW OF STORE-FILE
    2 SU-ID                (N4)
    2 SU-NAME              (A40)
    2 SU-STATUS            (A1)
    2 SU-FULFILLMENT-CAP   (A1)
    2 SU-SHIP-FROM-STORE   (A1)
    2 SU-PICKUP-AVAIL      (A1)
    2 SU-MODIFIED-DATE     (D)
    2 SU-MODIFIED-BY       (A8)
END-DEFINE
*
MOVE *USER TO #USER-ID
RESET P-RC
*
FIND STORE-UPD WITH SU-ID = P-STORE-ID
  IF NO RECORDS FOUND
    MOVE 200 TO P-RC
    MOVE 'STORE NOT FOUND' TO P-RC-TEXT
    ESCAPE ROUTINE
  END-NOREC
*
  GET STORE-UPD *ISN (HOLD)
*
  ON ERROR
    MOVE 305 TO P-RC
    MOVE 'STORE RECORD LOCKED' TO P-RC-TEXT
    ESCAPE ROUTINE
  END-ERROR
*
  DECIDE ON FIRST VALUE OF P-UPDATE-TYPE
    VALUE 'STAT'
      IF P-NEW-STATUS NE 'A' AND P-NEW-STATUS NE 'C'
          AND P-NEW-STATUS NE 'T' AND P-NEW-STATUS NE 'R'
        MOVE 202 TO P-RC
        MOVE 'INVALID STORE STATUS' TO P-RC-TEXT
        BACKOUT TRANSACTION
        ESCAPE ROUTINE
      END-IF
      MOVE P-NEW-STATUS TO SU-STATUS
    VALUE 'NAME'
      MOVE P-NEW-NAME TO SU-NAME
    VALUE 'OPS'
      * MODIFIED 2020-02-28 - BOPIS
      IF P-FULFILL-CAP NE ' '
        MOVE P-FULFILL-CAP TO SU-FULFILLMENT-CAP
      END-IF
      IF P-SHIP-FROM NE ' '
        MOVE P-SHIP-FROM TO SU-SHIP-FROM-STORE
      END-IF
      IF P-PICKUP NE ' '
        MOVE P-PICKUP TO SU-PICKUP-AVAIL
      END-IF
    NONE VALUE
      MOVE 202 TO P-RC
      MOVE 'INVALID UPDATE TYPE' TO P-RC-TEXT
      BACKOUT TRANSACTION
      ESCAPE ROUTINE
  END-DECIDE
*
  MOVE *DATX    TO SU-MODIFIED-DATE
  MOVE #USER-ID TO SU-MODIFIED-BY
  UPDATE STORE-UPD
  ESCAPE BOTTOM
END-FIND
*
END OF TRANSACTION
*
MOVE P-STORE-ID TO #STORE-STR
CALLNAT 'AUDITN' 'STOR' #STORE-STR 'U' P-UPDATE-TYPE
  ' ' ' ' 'STORE UPDATED'
*
END
