* >Natural Source Code: WHUPD
* SUBPROGRAM: WHUPD - WAREHOUSE UPDATE
* DESCRIPTION: UPDATES WAREHOUSE RECORDS
* LIBRARY: RETAILCORE
* ADABAS FILE: 104 (WAREHOUSE)
* CREATED: 1999-02-01  D. CHEN
* MODIFIED: 2013-06-15 - ADDED CAPACITY MANAGEMENT
* -------------------------------------------------------
DEFINE DATA
PARAMETER
  1 P-WH-ID               (N4)
  1 P-UPDATE-TYPE          (A4)    /* STAT CAPC */
  1 P-NEW-STATUS           (A1)
  1 P-CAPACITY-CHANGE      (N10)   /* POSITIVE=ADD NEGATIVE=REMOVE */
  1 P-RC                   (N4)
  1 P-RC-TEXT              (A80)
*
LOCAL
  1 #USER-ID               (A8)
  1 #WH-STR                (A15)
*
  1 WH-UPD VIEW OF WAREHOUSE-FILE
    2 WU-ID                (N4)
    2 WU-STATUS            (A1)
    2 WU-USED-CAPACITY     (N10)
    2 WU-AVAIL-CAPACITY    (N10)
    2 WU-TOTAL-CAPACITY    (N10)
    2 WU-MODIFIED-DATE     (D)
    2 WU-MODIFIED-BY       (A8)
END-DEFINE
*
MOVE *USER TO #USER-ID
RESET P-RC
*
FIND WH-UPD WITH WU-ID = P-WH-ID
  IF NO RECORDS FOUND
    MOVE 210 TO P-RC
    MOVE 'WAREHOUSE NOT FOUND' TO P-RC-TEXT
    ESCAPE ROUTINE
  END-NOREC
*
  GET WH-UPD *ISN (HOLD)
*
  DECIDE ON FIRST VALUE OF P-UPDATE-TYPE
    VALUE 'STAT'
      IF P-NEW-STATUS NE 'A' AND P-NEW-STATUS NE 'C'
          AND P-NEW-STATUS NE 'M'
        MOVE 211 TO P-RC
        MOVE 'INVALID WAREHOUSE STATUS' TO P-RC-TEXT
        BACKOUT TRANSACTION
        ESCAPE ROUTINE
      END-IF
      MOVE P-NEW-STATUS TO WU-STATUS
    VALUE 'CAPC'
      * UPDATE CAPACITY (RECEIPT/DISPATCH)
      ADD P-CAPACITY-CHANGE TO WU-USED-CAPACITY
      COMPUTE WU-AVAIL-CAPACITY = WU-TOTAL-CAPACITY - WU-USED-CAPACITY
      IF WU-AVAIL-CAPACITY < 0
        MOVE 0 TO WU-AVAIL-CAPACITY
      END-IF
    NONE VALUE
      MOVE 211 TO P-RC
      MOVE 'INVALID UPDATE TYPE' TO P-RC-TEXT
      BACKOUT TRANSACTION
      ESCAPE ROUTINE
  END-DECIDE
*
  MOVE *DATX    TO WU-MODIFIED-DATE
  MOVE #USER-ID TO WU-MODIFIED-BY
  UPDATE WH-UPD
  ESCAPE BOTTOM
END-FIND
*
END OF TRANSACTION
*
MOVE P-WH-ID TO #WH-STR
CALLNAT 'AUDITN' 'WH' #WH-STR 'U' P-UPDATE-TYPE
  ' ' ' ' 'WAREHOUSE UPDATED'
*
END
